CFE_project_builder_1C/Catalogs/сп_СценарииСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>сп_СценарииСборки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.сп_Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляРасширения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CFE_project_builder_1C/Catalogs/сп_Команды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>сп_Команды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.сп_Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CFE_project_builder_1C/Catalogs/сп_СценарииСборки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПредопределенныеСценарии() Экспорт 
	
	МенеджерСценарий = Справочники.сп_СценарииСборки;
	МенеджерКоманды  = Справочники.сп_Команды;
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Init, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.CoreQuotepathFalse, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.CoreAutocrlfTrue, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.MergeToolKdiff3, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.MergetoolKdiff3Path, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.MergetoolKdiff3KeepBackup, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ВыгрузитьКонфигурациюВФайлы, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ВыгрузитьКонфигурациюРасширенияВФайлы, Истина));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Add, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Commit, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.BranchDEV, Ложь));
	
	ИзменитьКоманду(МенеджерСценарий.ДемоИнициализацияРепозиторияПодключениеKDiff3, НаборКоманд);
	
	////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.CheckoutMaster, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ОбновлениеИБИзХранилища, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ОбновлениеИБИзХранилищаРасширения, Истина));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ВыгрузитьКонфигурациюВФайлы, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ВыгрузитьКонфигурациюРасширенияВФайлы, Истина));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Add, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Commit, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.CheckoutDEV, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ВыгрузитьКонфигурациюВФайлыDEV, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ВыгрузитьКонфигурациюРасширенияВФайлыDEV, Истина));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Add, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Commit, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.MergeMaster, Ложь));
	
	ИзменитьКоманду(МенеджерСценарий.ДемоПодготовкаСборкиCF_CFE, НаборКоманд);
	
	////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.ОчиститьКаталогСборки, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.CheckoutDEV, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Commit, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ПодготовитьКаталогСборки, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ЗагрузитьКонфигурациюCF, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ЗагрузитьКонфигурациюРасширенияCFE, Истина));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ОбновлениеИБ, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ОбновлениеИБРасширения, Истина));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ВыгрузкаКонфигурацииCF, Ложь));
	НаборКоманд.Добавить(Новый Структура("Команда, ДляРасширения", МенеджерКоманды.Команда1С_ВыгрузкаКонфигурацииРасширениCFE, Истина));
	
	ИзменитьКоманду(МенеджерСценарий.ДемоСборкаCF_CFEизDEV, НаборКоманд);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьКоманду(ТекСсылка, Команды)

	ТекОбъект = ТекСсылка.ПолучитьОбъект();
	ТекОбъект.НаборКоманд.Очистить();
	
	Для каждого Команда Из Команды Цикл
		ЗаполнитьЗначенияСвойств(ТекОбъект.НаборКоманд.Добавить(), Команда);
	КонецЦикла;

	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекОбъект);

КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
